12/data/attachments/d42c6d2bea0835ae.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Katherine_once_Friend_74959_7</nif:username>
            <nif:friendToBeRequested>soap_friends_3754447f-dfc3-47cd-b37d-4449d64219da</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>